
/**
 * 多播方式的数据传输是基于UDP完成的，采用多播方式时，可以同时向多个主机传递数据 
 * 特点如下：
 *  - 多播服务器针对特定多播组，只发送一次数据
 *  - 即使只发送一次数据，但该组内的所有客户端都会接收数据
 *  - 多播组数可在IP地址范围内任意增加
 *  - 加入特定组，即可接收发往该多播组的数据
 * 
 * 多播组是D类IP地址（224.0.0.0 ~ 239.255.255.255）
 * 
 * 多播向网络传递一个多播数据包时，路由器将复制该数据包并传递到多个主机。
 * 
 * 为了传递多播数据包，必须设置TTL（生存时间），时决定数据包传递距离的主要因素。
 * TTL用整数表示，并且每经过1个路由就减1；TTL变为0时，该数据包无法再被传递，只能销毁。
 * 因此，如果TTL的值设置过大将影响网络流量，如果过小，则无法传递至目标。
 * 
 * 多播组即使跨越不同网络的情况下，只要加入多播组就能接收数据。
 * ================================================================================
 * 
 * 广播也是基于UDP完成的，根据传输数据时使用的IP地址形式，可分为2种：
 *  - 直接广播（除了网络地址外，其余主机地址全部设置为1，例如希望向网络地址192.12.34中的所有主机传输数据时
 *      可以向192.12.34.255传输，即可以采用直接广播的方式向特定区域内所有主机传输数据）
 *  - 本地广播（限定使用的IP地址为255.255.255.255。例如，192.32.24网络中的主机向 255.255.255.255
 *      传输数据时，数据将传递到192.32.24网络中的所有主机）
 * 
 * 
 * 
*/